#include "PIT.h"

word pitHeartbeat;   //pit心跳

/*************************************************************************
*  说明:  pit0初始化函数
*        
*  作者:  Azmat
*  日期:  2017.9.22
**************************************************************************/

void InitPIT(void)  
{  	    
	 PITCFLMT_PITE=0;     //关闭PIT	        
	 PITMTLD0=32-1;       //8位定时器初值设定。32分频，在32MHzBusClock下，为1MHz,即1us   
	 PITLD0=1000-1;       //设置通道0计数器的值 
	                      //经过上面的计算得出通道0产生中断时间为((31+1)*(1000-1+1)/32000000)=10ms
	 PITCE_PCE0=1;        //使能通道0     
	 PITMUX_PMUX0=0;      //0：相应16位定时器与微时基0连接     
	 PITINTE_PINTE0=1;    //开通PIT0定时器的溢出中断         
	 PITCFLMT_PITE=1;     //PIT使能   
}


/*************************************************************************
*  说明:  任务调度核心中断
*        
*  作者:  Azmat
*  日期:  2017.9.22
**************************************************************************/
#pragma CODE_SEG __NEAR_SEG NON_BANKED
 void interrupt 66 PIT0(void)   
 { 
   PITTF_PTF0 = 0x01;  //清中断标志位
   pitHeartbeat ++;
   rdyStateUpdate();   //更新任务就绪状态变量
 }
   
#pragma CODE_SEG DEFAULT
   














